app/controllers/shipments_controller.rb

  def show
    s = Shipment.find(params[:id])
---
SELECT "shipments".* FROM "shipments" WHERE ("shipments"."id" = 1) LIMIT 1

  def new
    s = Shipment.new
    action_secure(s.can_edit?(current_user),s,{:verb => "create",:module_name=>"shipment"}) {
      @shipment = s
  		@shipping_addresses = Address.find_shipping
  		@carriers = Company.find_carriers
---
SELECT "addresses".* FROM "addresses" WHERE (shipping = 't')
SELECT "companies".* FROM "companies" WHERE (carrier = 't')

  def edit
    s = Shipment.find(params[:id])
    action_secure(s.can_edit?(current_user),s,{:verb => "edit",:module_name=>"shipment"}) {
      @shipment = s
  		@shipping_addresses = Address.find_shipping
  		@carriers = Company.find_carriers
---
SELECT "shipments".* FROM "shipments" WHERE ("shipments"."id" = 1) LIMIT 1
SELECT "addresses".* FROM "addresses" WHERE (shipping = 't')
SELECT "companies".* FROM "companies" WHERE (carrier = 't')

  def create
    s = Shipment.new(params[:shipment])
    action_secure(s.can_edit?(current_user),s,{:verb => "create",:module_name=>"shipment"}) {
      @shipment = s
      respond_to do |format|
        if @shipment.save
---
INSERT INTO "shipments" ("ata", "atd", "carrier_id", "created_at", "eta", "etd", "reference", "ship_from_id", "ship_to_id", "updated_at") VALUES ('2010-09-13', '2010-09-13', 1, '2010-09-29 00:33:37.000000', '2010-09-13', '2010-09-13', 'Shipment One', 1, 1, '2010-09-29 00:33:37.000000')

  def update
    s = Shipment.find(params[:id])
---
SELECT "shipments".* FROM "shipments" WHERE ("shipments"."id" = 1) LIMIT 1

  def destroy
    s = Shipment.find(params[:id])
    action_secure(s.can_edit?(current_user),s,{:verb => "delete",:module_name=>"shipment"}) {
      @shipment = s
      @shipment.destroy
---
SELECT "shipments".* FROM "shipments" WHERE ("shipments"."id" = 1) LIMIT 1
DELETE FROM "shipments" WHERE ("shipments"."id" = 1)