app/views/shipments/_form.html.erb

<% content_for :javascript do %>
$(function() {
	setupShippingAddress('Master Company',$('#shipment_ship_to_id'),$('#ship_to_ad'),<%=Company.find_by_master(true).id%><%=@shipment.ship_to_id.nil? ? '' : ",#{@shipment.ship_to_id}"%>);
	setupShippingAddress('Vendor',$('#shipment_ship_from_id'),$('#ship_from_ad'),<%=@shipment.vendor.nil? ? "'not set'": @shipment.vendor.id%><%=@shipment.ship_from_id.nil? ? '' : ",#{@shipment.ship_from_id}"%>);
  getAddress($('#ship_from_ad'),$("#shipment_ship_from_id").val());
  $("#shipment_vendor_id").change(function() {
     setupShippingAddress('Vendor',$('#shipment_ship_from_id'),$('#ship_from_ad'),$(this).val());
  });
  $("#btn_save").click(function() {
    $("#frm_shp").submit();
  });
  $("#btn_cancel").click(function() {
    window.location = '<%=url_for @shipment%>';
  });
  OpenChain.addClickMap('s','Save','btn_save');
  OpenChain.addClickMap('c','Cancel','btn_cancel');
  OpenChain.addClickMap('n','Next','btn_edit_next');
  OpenChain.addClickMap('p','Previous','btn_edit_previous');
  OpenChain.activateHotKeys();
});
---
SELECT "companies".* FROM "companies" WHERE (carrier = 't')